In [1]:
import pandas as pd
import numpy as np
file_path = "Resources/purchase_data.csv"
purchase = pd.read_csv(file_path)
purchase.head()
total_players = []
tot = []
age = []
age_final =[]
total_purchase = 0
purchase_dup = []

In [2]:
total_players = purchase["SN"]
tot = (set(total_players))
tot = len(tot)
purchase.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
unique = len(set(purchase["Item ID"]))
unique

183

In [4]:
mean = round(purchase["Price"].mean(),2)
mean = float(mean)
mean = '${:,.2f}'.format(mean)
mean

'$3.05'

In [5]:
total_purchase = len(purchase["Item Name"])
total_purchase

780

In [6]:
Total_Revenue = purchase["Price"].sum()

In [7]:
Total_Revenue = float(Total_Revenue)
Total_Revenue = '${:,.2f}'.format(Total_Revenue)
Total_Revenue

'$2,379.77'

In [8]:
#summary = [unique,mean,total_purchase,Total_Revenue]
#summary1 = ["Number of Unique Items","Average Price","Number of Purchases","Total Revenue"]

In [9]:
#summary_merge = zip(summary1,summary)

In [10]:
#summary_merge = list(summary_merge)

In [11]:
#summary_merge

In [12]:
purchase_over = purchase["Gender"].value_counts()
purchase_over
purchase_male = purchase.loc[purchase['Gender']=='Male',:]

In [13]:
purchase_male.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [14]:
purchase_female = purchase.loc[purchase['Gender']=='Female',:]

In [15]:
purchase_female.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [16]:
purchase_other = purchase.loc[purchase['Gender']=='Other / Non-Disclosed']
purchase_other.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [17]:
male_count = len(set(purchase_male["SN"]))

In [18]:
female_count = len(set(purchase_female["SN"]))
other_count = len(set(purchase_other["SN"]))

In [19]:
percentage_male = round((male_count/tot)*100,2)

In [20]:
percentage_female = round((female_count/tot)*100,2)

In [21]:
percentage_other =  round((other_count/tot)*100,2)

In [22]:
count = [male_count,percentage_male,female_count,percentage_female,other_count,percentage_other]

In [23]:
count

[484, 84.03, 81, 14.06, 11, 1.91]

In [24]:
male_count_pa = len(purchase_male["SN"])
male_count_pa = float(male_count_pa)
female_count_pa = len(purchase_female["SN"])
female_count_pa = float(female_count_pa)
other_count_pa = len(purchase_other["SN"])
other_count_pa = float(other_count_pa)

In [25]:
tot_purchase_male = purchase_male["Price"].sum()
tot_purchase_male = float(tot_purchase_male)
tot_purchase_male ='${:,.2f}'.format(tot_purchase_male)
tot_purchase_male2 = purchase_male["Price"].sum()

tot_purchase_female = purchase_female["Price"].sum()
tot_purchase_female = float(tot_purchase_female )
tot_purchase_female ='${:,.2f}'.format(tot_purchase_female)
tot_purchase_female2 = purchase_female["Price"].sum()

tot_purchase_other = purchase_other["Price"].sum()
tot_purchase_other = float(tot_purchase_other)
tot_purchase_other ='${:,.2f}'.format(tot_purchase_other)
tot_purchase_other2 = purchase_other["Price"].sum()

avg_pur_male = round((tot_purchase_male2/male_count_pa),2)
avg_pur_male = float(avg_pur_male)
avg_pur_male = '${:,.2f}'.format(avg_pur_male)

avg_pur_female = round((tot_purchase_female2/female_count_pa),2) 
avg_pur_female = float(avg_pur_female)
avg_pur_female = '${:,.2f}'.format(avg_pur_female)

avg_pur_other = round((tot_purchase_other2/other_count_pa),2)
avg_pur_other = float(avg_pur_other)
avg_pur_other = '${:,.2f}'.format(avg_pur_other)

tot_avg_perp_male = round((tot_purchase_male2/male_count),2)
tot_avg_perp_male = float(tot_avg_perp_male)
tot_avg_perp_male = '${:,.2f}'.format(tot_avg_perp_male)

tot_avg_perp_female = round((tot_purchase_female2/female_count),2)
tot_avg_perp_female = float(tot_avg_perp_female)
tot_avg_perp_female = '${:,.2f}'.format(tot_avg_perp_female)

tot_avg_perp_other = round((tot_purchase_other2/other_count),2)
tot_avg_perp_other = float(tot_avg_perp_other)
tot_avg_perp_other = '${:,.2f}'.format(tot_avg_perp_other)

# Player Count

In [26]:
rawdata = {'Total Players':[tot]}

In [27]:
df = pd.DataFrame(rawdata)
df

   Total Players
0            576

# Purchasing Analysis (Total)

In [28]:
rawdata2 = {'Number of Unique Items':[unique],
      'Average Price':[mean],
      'Number of Purchases':[total_purchase],
     'Total Revenue':[Total_Revenue]}

In [29]:
df2 = pd.DataFrame(rawdata2)
df2

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

# Gender Demographics

In [30]:
rawdata3 = {
           'Total Count':[male_count,female_count,other_count],
           'Percentage Of Players':[percentage_male,percentage_female,percentage_other]}

In [31]:
df3 = pd.DataFrame(rawdata3,index=['Male','Female','Other / Non-Disclosed'])
df3

                       Total Count  Percentage Of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

#  Purchasing Analysis (Gender)

In [32]:
rawdata4 = {'Purchase Count': [female_count_pa,male_count_pa,other_count_pa],
      'Average Purchase Price':[avg_pur_female,avg_pur_male,avg_pur_other],
      'Total Purchase Value':[tot_purchase_female,tot_purchase_male,tot_purchase_other],
      'Avg Total Purchase per Person':[tot_avg_perp_female,tot_avg_perp_male,tot_avg_perp_other]}
df4 = pd.DataFrame(rawdata4,index=['Female','Male','Other / Non-Disclosed'])
df4

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113.0,$3.20,$361.94,$4.47
Male,652.0,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15.0,$3.35,$50.19,$4.56

#  Age Demographics

In [33]:
bins = [0,9,14,19,24,29,34,39,500]
labels =["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [34]:
purchase_dup = pd.DataFrame(purchase["SN"])
purchase_dup.drop_duplicates(inplace=True)
purchase_dup

purchase_dup["Age"] = purchase["Age"]
purchase_dup["Price"] = purchase["Price"]
purchase_dup["Percentage Players"] = purchase_dup["Age"] / purchase_dup["Age"].sum()
purchase_dup["Age Group"] = pd.cut(purchase_dup['Age'],bins=bins,labels=labels)
purchase_bin = purchase_dup.groupby(['Age Group'])

pd1 = purchase_bin[["SN"]].count()
pd2 = pd1["SN"]/pd1["SN"].sum()
pd2 = round(pd2*100,2)
pd1["Percentage Players"] = pd2 #((pd1["SN"]/pd1["SN"].sum()*100))
pd1.columns = ["Total Count","Percentage Players"]
pd1

           Total Count  Percentage Players
Age Group
<10                 17                2.95
10-14               22                3.82
15-19              107               18.58
20-24              258               44.79
25-29               77               13.37
30-34               52                9.03
35-39               31                5.38
40+                 12                2.08

# Purchasing Analysis (Age)

In [35]:
purchase.head()
purchase_analysis1 = pd.DataFrame(purchase["Purchase ID"])
purchase_analysis1["Age"] = purchase["Age"]
purchase_analysis1["Price"] = purchase["Price"]
purchase_analysis1["Age Group"] = pd.cut(purchase_analysis1['Age'],bins=bins,labels=labels)
purchase_analysis1.head()
purchase_analysis2 = purchase_analysis1.groupby(['Age Group'])
purchase_analysis2.head()
pa1 = purchase_analysis2[["Purchase ID"]].count()
pa2 = round(purchase_analysis2["Price"].mean(),2)
pa3 = round(purchase_analysis2["Price"].sum(),2)
purchase_dup 
pa4 = purchase_dup.groupby(["Age Group"])
pa4.head()
pa5 = pa4["SN"].count()
pa5
pa6 = round(pa3/pa5,2)

pa2 = pa2.map("${:.2f}".format)
pa3 = pa3.map("${:.2f}".format)
pa6 = pa6.map("${:.2f}".format)

result = pd.concat([pa1, pa2,pa3,pa6], axis=1, join='inner')

result.columns = ["Purchase Count","Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]
result

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

# Top Spenders

In [36]:
top_spenders = pd.DataFrame(purchase["SN"])
top_spenders["Age"] = purchase["Age"]
top_spenders["Purchase ID"] = purchase["Purchase ID"]
top_spenders["Price"] = purchase["Price"]
top_spenders["Age Group"] = pd.cut(top_spenders['Age'],bins=bins,labels=labels)
top_spenders
top_spenders2 = top_spenders.groupby(['SN'])
top_spenders2


ts1 = top_spenders2[["Purchase ID"]].count()
ts2 = top_spenders2[["Price"]].sum()
ts3 = top_spenders2[["Price"]].mean()
ts4 = purchase["SN"].value_counts()
ts3.columns = ["Average Purchase Price"]
ts4.columns = ["Purchase Count"]
ts2.columns =["Total Purchase Value"]
ts2['Total Purchase Value'] = ts2['Total Purchase Value'].map("${:.2f}".format)
ts3["Average Purchase Price"] = ts3["Average Purchase Price"].map("${:.2f}".format)
result2 = pd.concat([ts4,ts3,ts2], axis=1, join='inner')
#result2 = result2.sort_values(by=['Total'], ascending = False)
result2.head()

             SN Average Purchase Price Total Purchase Value
Lisosia93     5                  $3.79               $18.96
Idastidru52   4                  $3.86               $15.45
Iral74        4                  $3.40               $13.62
Silaera56     3                  $2.83                $8.48
Aelin32       3                  $2.99                $8.98

#  Most Popular Items

In [37]:
popular_most = pd.DataFrame(purchase["Item ID"])
popular_most["Item Name"] = purchase["Item Name"]
popular_most["Price"] = purchase["Price"]

popular_most
popular_most2 = popular_most.groupby(['Item ID','Item Name'])
pm1 = popular_most2['Price'].mean()
pm2 = popular_most2["Price"].sum()
pm3 = popular_most2["Item ID"].count()
pm1 = pm1.map("${:.2f}".format)
pm2 = pm2.map("${:.2f}".format)
result3 = pd.concat([pm3,pm1,pm2],axis=1, join='inner')
result3.columns = ["Purchase Count","Item Price","Total Purchase Value"]
most_popular = result3.sort_values(by="Purchase Count",ascending=False)
most_popular.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

# Most Profitable Items

In [38]:
popular_most = pd.DataFrame(purchase["Item ID"])
popular_most["Item Name"] = purchase["Item Name"]
popular_most["Price"] = purchase["Price"]

popular_most
popular_most2 = popular_most.groupby(['Item ID','Item Name'])
pm1 = popular_most2['Price'].mean()
pm2 = popular_most2["Price"].sum()
pm3 = popular_most2["Item ID"].count()



result4 = pd.concat([pm3,pm1,pm2],axis=1, join='inner')
result4.columns = ["Purchase Count","Item Price","Total Purchase Value"]


most_profitable = result4.sort_values(by='Total Purchase Value',ascending=False)
most_profitable.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

In [39]:
#result4 = result4.sort_values(by="Total Purchase Value",ascending=False)